In [1]:
print("Bismillah Hirrahamaa Nirraheem")

Bismillah Hirrahamaa Nirraheem

In [3]:
import os,time,re,json,math,warnings
warnings.filterwarnings("ignore")
import numpy as np
import pandas as pd
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
import plotly.io as pio
pio.templates.default = "plotly_dark"
os.cpu_count()

12

In [25]:
train_path = "Downloads/credit_risk/train/"
test_path = "Downloads/credit_risk/test/"
num_train_files = len(os.listdir("/home/sohail/Downloads/credit_risk/train"))
num_test_files = len(os.listdir("/home/sohail/Downloads/credit_risk/test"))
train_files = [train_path + _ for _ in os.listdir("/home/sohail/Downloads/credit_risk/train")]
test_files = [test_path + _ for _ in os.listdir("/home/sohail/Downloads/credit_risk/train")]

In [21]:
print(num_train_files)
print(num_test_files)

32
36

In [22]:
features = pd.read_csv("Downloads/feature_definitions.csv")
features.head()

                  Variable                                        Description
0           actualdpd_943P  Days Past Due (DPD) of previous contract (actu...
1  actualdpdtolerance_344P                      DPD of client with tolerance.
2     addres_district_368M                  District of the person's address.
3         addres_role_871L                          Role of person's address.
4          addres_zip_823M                           Zip code of the address.

In [30]:
train_1 = pd.read_parquet(train_files[1])
print(train_1.shape)
train_1.head()

(3275770, 5)

   case_id  amount_4527230A name_4527232M  num_group1 recorddate_4527225D
0    28631        1946.0000      f980a1ea           2          2019-09-13
1    28631         711.0000      f980a1ea           3          2019-09-13
2    28631        3616.4001      f980a1ea           0          2019-09-13
3    28631        2600.0000      f980a1ea           1          2019-09-13
4    28632        2564.0000      5f9b74f5           5          2019-09-13

In [33]:
_ = {}
dtypes_list = ["int16","float16","object","int16","object"]
for d,c in zip(dtypes_list,train_1.columns):
    _[c] = d

In [41]:
for file in train_files:
    _ = pd.read_parquet(file)
    display(_.head()) 
    print(_.shape)
    print(_.memory_usage(deep=True).sum()/(1024**2))

,case_id,cacccardblochreas_147M,conts_type_509L,credacc_cards_status_52L,num_group1,num_group2
0,2,None,EMPLOYMENT_PHONE,None,1,1
1,2,None,EMPLOYMENT_PHONE,None,0,1
2,2,None,PRIMARY_MOBILE,None,0,0
3,2,None,PRIMARY_MOBILE,None,1,0
4,3,None,PRIMARY_MOBILE,None,0,1

(14075487, 6)
2357.3996534347534

   case_id  amount_4527230A name_4527232M  num_group1 recorddate_4527225D
0    28631        1946.0000      f980a1ea           2          2019-09-13
1    28631         711.0000      f980a1ea           3          2019-09-13
2    28631        3616.4001      f980a1ea           0          2019-09-13
3    28631        2600.0000      f980a1ea           1          2019-09-13
4    28632        2564.0000      5f9b74f5           5          2019-09-13

(3275770, 5)
487.5217914581299

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,51083,9a0c095e,9a0c095e,0.0,0.0,c7a5ad39,c7a5ad39,0,0,NaN,NaN,2.0,2.0,NaN,NaN,2018.0,2007.0,ab3c25cf,ab3c25cf
1,51083,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,3.0,NaN,NaN,2018.0,2007.0,a55475b1,a55475b1
2,51083,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,4.0,NaN,NaN,2018.0,2007.0,a55475b1,a55475b1
3,51083,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,5.0,NaN,NaN,2018.0,2007.0,a55475b1,a55475b1
4,51083,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,6.0,6.0,NaN,NaN,2018.0,2007.0,a55475b1,a55475b1

(13927071, 19)
6561.253955841064

,case_id,assignmentdate_238D,assignmentdate_4527235D,assignmentdate_4955616D,birthdate_574D,contractssum_5085716L,dateofbirth_337D,dateofbirth_342D,days120_123L,days180_256L,...,pmtscount_423L,pmtssum_45A,requesttype_4525192L,responsedate_1012D,responsedate_4527233D,responsedate_4917613D,riskassesment_302T,riskassesment_940T,secondquarter_766L,thirdquarter_1082L
0,357,None,None,None,1988-04-01,NaN,None,None,NaN,NaN,...,6.0,6301.4000,None,2019-01-25,None,None,None,NaN,NaN,NaN
1,381,None,None,None,1973-11-01,NaN,None,None,NaN,NaN,...,6.0,4019.6000,None,2019-01-25,None,None,None,NaN,NaN,NaN
2,388,None,None,None,1989-04-01,NaN,1989-04-01,None,6.0,8.0,...,6.0,14548.0000,None,2019-01-28,None,None,None,NaN,3.0,5.0
3,405,None,None,None,1974-03-01,NaN,1974-03-01,None,0.0,0.0,...,6.0,10498.2400,None,2019-01-21,None,None,None,NaN,2.0,0.0
4,409,None,None,None,1993-06-01,NaN,1993-06-01,None,2.0,3.0,...,7.0,6344.8804,None,2019-01-21,None,None,None,NaN,0.0,4.0

(1500476, 53)
1458.8478116989136

,case_id,last180dayaveragebalance_704A,last180dayturnover_1134A,last30dayturnover_651A,num_group1,openingdate_857D
0,225,NaN,NaN,NaN,0,2016-08-16
1,331,NaN,NaN,NaN,0,2015-03-19
2,358,NaN,NaN,NaN,0,2014-09-02
3,390,NaN,NaN,NaN,0,2014-07-23
4,390,NaN,NaN,NaN,2,2016-06-08

(157302, 6)
15.530465126037598

,case_id,birth_259D,birthdate_87D,childnum_185L,contaddr_district_15M,contaddr_matchlist_1032L,contaddr_smempladdr_334L,contaddr_zipcode_807M,education_927M,empl_employedfrom_271D,...,registaddr_district_1083M,registaddr_zipcode_184M,relationshiptoclient_415T,relationshiptoclient_642T,remitter_829L,role_1084L,role_993L,safeguarantyflag_411L,sex_738L,type_25L
0,0,1986-07-01,None,NaN,P88_18_84,False,False,P167_100_165,P97_36_170,2017-09-15,...,P88_18_84,P167_100_165,None,None,None,CL,None,True,F,PRIMARY_MOBILE
1,0,None,None,NaN,a55475b1,None,None,a55475b1,a55475b1,None,...,a55475b1,a55475b1,SPOUSE,None,False,EM,None,None,None,PHONE
2,0,None,None,NaN,a55475b1,None,None,a55475b1,a55475b1,None,...,a55475b1,a55475b1,COLLEAGUE,SPOUSE,False,PE,None,None,None,PHONE
3,0,None,None,NaN,a55475b1,None,None,a55475b1,a55475b1,None,...,a55475b1,a55475b1,None,COLLEAGUE,None,PE,None,None,None,PHONE
4,1,1957-08-01,None,NaN,P103_93_94,False,False,P176_37_166,P97_36_170,2008-10-29,...,P103_93_94,P176_37_166,None,None,None,CL,None,True,M,PRIMARY_MOBILE

(2973991, 37)
3782.9573831558228

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,29427,9a0c095e,a55475b1,0.0,NaN,a55475b1,c7a5ad39,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2019.0,NaN,a55475b1,ab3c25cf
1,29427,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2019.0,NaN,a55475b1,a55475b1
2,29427,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,NaN,NaN,NaN,2019.0,NaN,a55475b1,a55475b1
3,29427,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,0.0,NaN,5.0,NaN,0.0,NaN,2019.0,NaN,a55475b1,a55475b1
4,29427,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,0.0,NaN,6.0,NaN,0.0,NaN,2019.0,NaN,a55475b1,a55475b1

(27025737, 19)
12732.233687400818

   case_id date_decision   MONTH  WEEK_NUM  target
0        0    2019-01-03  201901         0       0
1        1    2019-01-03  201901         0       0
2        2    2019-01-04  201901         0       0
3        3    2019-01-03  201901         0       0
4        4    2019-01-04  201901         0       1

(1526659, 5)
144.13773822784424

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,13927,8fd95e4b,a55475b1,0.0,NaN,a55475b1,c7a5ad39,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,ab3c25cf
1,13927,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
2,13927,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
3,13927,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
4,13927,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,0.0,NaN,6.0,NaN,0.0,NaN,2017.0,NaN,a55475b1,a55475b1

(17893536, 19)
8429.91582775116

,case_id,annualeffectiverate_199L,annualeffectiverate_63L,classificationofcontr_13M,classificationofcontr_400M,contractst_545M,contractst_964M,contractsum_5085717L,credlmt_230A,credlmt_935A,...,residualamount_488A,residualamount_856A,subjectrole_182M,subjectrole_93M,totalamount_6A,totalamount_996A,totaldebtoverduevalue_178A,totaldebtoverduevalue_718A,totaloutstanddebtvalue_39A,totaloutstanddebtvalue_668A
0,51903,NaN,NaN,ea6782cc,a55475b1,7241344e,a55475b1,13591.00,NaN,30000.0,...,NaN,2718.20,ab3c25cf,a55475b1,NaN,NaN,0.0,NaN,10602.11,NaN
1,51903,NaN,NaN,ea6782cc,a55475b1,7241344e,a55475b1,39419.55,NaN,11260.0,...,NaN,7883.91,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
2,51903,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
3,51903,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
4,51903,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN

(2079323, 79)
3224.2828073501587

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,53716,8fd95e4b,9a0c095e,0.0,0.0,c7a5ad39,c7a5ad39,0,0,NaN,NaN,2.0,2.0,NaN,NaN,2019.0,2017.0,ab3c25cf,ab3c25cf
1,53716,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,3.0,NaN,NaN,2019.0,2017.0,a55475b1,a55475b1
2,53716,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,4.0,NaN,NaN,2019.0,2017.0,a55475b1,a55475b1
3,53716,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,5.0,NaN,NaN,2019.0,2017.0,a55475b1,a55475b1
4,53716,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,6.0,6.0,NaN,NaN,2019.0,2017.0,a55475b1,a55475b1

(18723227, 19)
8820.795594215393

,case_id,annualeffectiverate_199L,annualeffectiverate_63L,classificationofcontr_13M,classificationofcontr_400M,contractst_545M,contractst_964M,contractsum_5085717L,credlmt_230A,credlmt_935A,...,residualamount_488A,residualamount_856A,subjectrole_182M,subjectrole_93M,totalamount_6A,totalamount_996A,totaldebtoverduevalue_178A,totaldebtoverduevalue_718A,totaloutstanddebtvalue_39A,totaloutstanddebtvalue_668A
0,388,NaN,NaN,4408ff0f,a55475b1,7241344e,a55475b1,NaN,NaN,NaN,...,NaN,NaN,ab3c25cf,ab3c25cf,NaN,268897.62,0.0,0.0,374419.5,0.0
1,388,NaN,NaN,ea6782cc,a55475b1,7241344e,a55475b1,NaN,NaN,135806.0,...,NaN,114325.805,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
2,388,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
3,388,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
4,388,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN

(4108212, 79)
5977.897443771362

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,21161,9a0c095e,a55475b1,0.0,NaN,a55475b1,c7a5ad39,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,ab3c25cf
1,21161,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
2,21161,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
3,21161,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
4,21161,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,6.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1

(26563901, 19)
12514.655851364136

,case_id,actualdpd_943P,annuity_853A,approvaldate_319D,byoccupationinc_3656910L,cancelreason_3545846M,childnum_21L,creationdate_885D,credacc_actualbalance_314A,credacc_credlmt_575A,...,num_group1,outstandingdebt_522A,pmtnum_8L,postype_4733339M,profession_152M,rejectreason_755M,rejectreasonclient_4145042M,revolvingaccount_394A,status_219L,tenor_203L
0,40704,0.0,7204.6000,None,NaN,P94_109_143,NaN,2018-11-20,NaN,0.0,...,0,NaN,12.0,P46_145_78,a55475b1,P198_131_9,P94_109_143,NaN,D,12.0
1,40734,0.0,3870.2000,None,NaN,P94_109_143,NaN,2019-12-26,NaN,0.0,...,0,NaN,18.0,P149_40_170,a55475b1,P45_84_106,P94_109_143,NaN,D,18.0
2,40737,0.0,2324.4001,None,1.0,a55475b1,0.0,2014-07-17,NaN,0.0,...,0,0.0,18.0,P46_145_78,a55475b1,a55475b1,a55475b1,NaN,D,18.0
3,40791,0.0,3044.4001,None,NaN,P94_109_143,NaN,2017-08-21,NaN,0.0,...,0,NaN,24.0,P177_117_192,a55475b1,P99_56_166,P94_109_143,NaN,D,24.0
4,40791,0.0,2320.8000,None,1.0,a55475b1,0.0,2014-12-28,NaN,0.0,...,1,0.0,12.0,P60_146_156,a55475b1,a55475b1,a55475b1,NaN,D,12.0

(2638295, 41)
3200.6395378112793

,case_id,annualeffectiverate_199L,annualeffectiverate_63L,classificationofcontr_13M,classificationofcontr_400M,contractst_545M,contractst_964M,contractsum_5085717L,credlmt_230A,credlmt_935A,...,residualamount_488A,residualamount_856A,subjectrole_182M,subjectrole_93M,totalamount_6A,totalamount_996A,totaldebtoverduevalue_178A,totaldebtoverduevalue_718A,totaloutstanddebtvalue_39A,totaloutstanddebtvalue_668A
0,19694,NaN,NaN,ea6782cc,a55475b1,7241344e,a55475b1,NaN,NaN,0.0,...,NaN,0.0,ab3c25cf,ab3c25cf,NaN,NaN,0.0,0.0,43315.26,0.0
1,19694,NaN,NaN,ea6782cc,a55475b1,7241344e,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,170000.0,NaN,NaN,NaN,NaN
2,19694,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
3,19694,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN
4,19694,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,NaN,NaN,NaN,NaN,NaN,NaN

(6009192, 79)
9207.184344291687

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,56408,a55475b1,8fd95e4b,NaN,0.0,3cbe86ba,a55475b1,0,0,NaN,NaN,NaN,2.0,NaN,NaN,NaN,2012.0,ab3c25cf,a55475b1
1,56408,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,NaN,3.0,NaN,NaN,NaN,2012.0,a55475b1,a55475b1
2,56408,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,NaN,4.0,NaN,NaN,NaN,2012.0,a55475b1,a55475b1
3,56408,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,NaN,5.0,NaN,NaN,NaN,2012.0,a55475b1,a55475b1
4,56408,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,NaN,6.0,NaN,NaN,NaN,2012.0,a55475b1,a55475b1

(4386062, 19)
2066.340284347534

,case_id,actualdpdtolerance_344P,amtinstpaidbefduel24m_4187115A,annuity_780A,annuitynextmonth_57A,applicationcnt_361L,applications30d_658L,applicationscnt_1086L,applicationscnt_464L,applicationscnt_629L,...,sellerplacecnt_915L,sellerplacescnt_216L,sumoutstandtotal_3546847A,sumoutstandtotalest_4493215A,totaldebt_9A,totalsettled_863A,totinstallast1m_4525188A,twobodfilling_608L,typesuite_864L,validfrom_1069D
0,40626,NaN,NaN,1976.2001,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,FO,AL,None
1,40704,NaN,NaN,3731.2000,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,FO,AL,None
2,40734,NaN,NaN,3731.2000,0.0,0.0,1.0,0.0,0.0,0.0,...,1.0,1.0,NaN,NaN,0.0,0.0,NaN,FO,AL,None
3,40737,0.0,NaN,2362.0000,0.0,0.0,0.0,2.0,0.0,0.0,...,0.0,1.0,NaN,NaN,0.0,0.0,NaN,FO,AL,None
4,40766,NaN,NaN,1143.0000,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,FO,AL,None

(522902, 168)
1416.0149717330933

,case_id,num_group1,num_group2,pmts_date_1107D,pmts_dpdvalue_108P,pmts_pmtsoverdue_635A
0,467,2,19,2018-05-15,0.0,0.0
1,467,2,25,2018-11-15,0.0,0.0
2,467,2,18,2018-04-15,0.0,0.0
3,467,2,0,2016-10-15,0.0,0.0
4,467,2,6,2017-04-15,0.0,0.0

(1286755, 6)
131.30466175079346

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,6683,8fd95e4b,a55475b1,6742800.0,NaN,a55475b1,9276e4bb,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,ab3c25cf
1,6683,8fd95e4b,a55475b1,6700000.0,NaN,a55475b1,0e63c0f0,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2017.0,NaN,a55475b1,a55475b1
2,6683,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,0.0,NaN,4.0,NaN,0.0,NaN,2017.0,NaN,a55475b1,a55475b1
3,6683,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,0.0,NaN,5.0,NaN,0.0,NaN,2017.0,NaN,a55475b1,a55475b1
4,6683,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,0.0,NaN,6.0,NaN,0.0,NaN,2017.0,NaN,a55475b1,a55475b1

(7861809, 19)
3703.8174753189087

   case_id   amount_416A contractenddate_991D  num_group1 openingdate_313D
0      225       0.00000                 None           0       2016-08-16
1      331     260.37400           2018-03-18           0       2015-03-19
2      358       0.00000                 None           0       2014-09-02
3      390  211748.53000           2017-07-22           0       2014-07-23
4      390     223.68001                 None           2       2016-06-08

(145086, 5)
18.59416389465332

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,388,8fd95e4b,a55475b1,0.0,NaN,a55475b1,c7a5ad39,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,ab3c25cf
1,388,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
2,388,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
3,388,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
4,388,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,6.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1

(5296031, 19)
2495.0406589508057

,case_id,actualdpdtolerance_344P,amtinstpaidbefduel24m_4187115A,annuity_780A,annuitynextmonth_57A,applicationcnt_361L,applications30d_658L,applicationscnt_1086L,applicationscnt_464L,applicationscnt_629L,...,sellerplacecnt_915L,sellerplacescnt_216L,sumoutstandtotal_3546847A,sumoutstandtotalest_4493215A,totaldebt_9A,totalsettled_863A,totinstallast1m_4525188A,twobodfilling_608L,typesuite_864L,validfrom_1069D
0,0,NaN,NaN,1917.6,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,BO,None,None
1,1,NaN,NaN,3134.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,BO,None,None
2,2,NaN,NaN,4937.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,BO,AL,None
3,3,NaN,NaN,4643.6,0.0,0.0,1.0,0.0,2.0,0.0,...,1.0,1.0,NaN,NaN,0.0,0.0,NaN,BO,AL,None
4,4,NaN,NaN,3390.2,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,NaN,NaN,0.0,0.0,NaN,BO,AL,None

(1003757, 168)
2689.437726020813

   case_id  amount_4917619A deductiondate_4917603D name_4917606M  num_group1
0    49435           6885.0             2019-10-16      6b730375           7
1    49435           6885.0             2019-10-16      6b730375           1
2    49435           6885.0             2019-10-16      6b730375           8
3    49435           6885.0             2019-10-16      6b730375           3
4    49435           6885.0             2019-10-16      6b730375           4

(1107933, 5)
164.89100456237793

   case_id employername_160M  num_group1  pmtamount_36A processingdate_168D
0      357          c91b12ff           5     1100.00000          2018-08-08
1      357          c91b12ff           1     1200.00000          2018-11-28
2      357          c91b12ff           4     1200.00000          2018-09-10
3      357          c91b12ff           0     1200.00000          2019-01-04
4      357          c91b12ff           3      628.60004          2018-10-08

(3343800, 5)
497.62333583831787

,case_id,amtdebitincoming_4809443A,amtdebitoutgoing_4809440A,amtdepositbalance_4809441A,amtdepositincoming_4809444A,amtdepositoutgoing_4809442A,num_group1
0,43801,12466.6010,12291.2000,914.2000,0.0,304.80002,0
1,43991,3333.4001,3273.4001,0.0000,0.0,0.00000,0
2,44001,10000.0000,10000.0000,0.0000,0.0,0.00000,0
3,44053,0.0000,0.0000,2586.4001,0.0,88.80000,0
4,44130,63.8000,60.8000,0.0000,0.0,0.00000,0

(51109, 7)
2.7296409606933594

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,49417,9a0c095e,8fd95e4b,0.0,0.0,3cbe86ba,c7a5ad39,0,0,NaN,NaN,2.0,2.0,NaN,NaN,2018.0,2014.0,ab3c25cf,ab3c25cf
1,49417,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,0.0,3.0,3.0,NaN,0.0000,2018.0,2014.0,a55475b1,a55475b1
2,49417,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,0.0,4.0,4.0,NaN,0.0000,2018.0,2014.0,a55475b1,a55475b1
3,49417,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,0.0,9.0,5.0,5.0,0.0,3939.0000,2018.0,2014.0,a55475b1,a55475b1
4,49417,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,0.0,11.0,6.0,6.0,0.0,3678.4001,2018.0,2014.0,a55475b1,a55475b1

(8055986, 19)
3795.2969818115234

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,36830,9a0c095e,8fd95e4b,0.0,0.0,3cbe86ba,c7a5ad39,0,0,NaN,NaN,2.0,2.0,NaN,NaN,2017.0,2013.0,ab3c25cf,ab3c25cf
1,36830,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,0.0,3.0,3.0,NaN,0.0,2017.0,2013.0,a55475b1,a55475b1
2,36830,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,0.0,4.0,4.0,NaN,0.0,2017.0,2013.0,a55475b1,a55475b1
3,36830,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,0.0,5.0,5.0,NaN,0.0,2017.0,2013.0,a55475b1,a55475b1
4,36830,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,0.0,6.0,6.0,NaN,0.0,2017.0,2013.0,a55475b1,a55475b1

(33053760, 19)
15572.126635551453

,case_id,amount_1115A,classificationofcontr_1114M,contractdate_551D,contractmaturitydate_151D,contractst_516M,contracttype_653M,credlmt_1052A,credlmt_228A,credlmt_3940954A,...,pmtmethod_731M,pmtnumpending_403L,purposeofcred_722M,residualamount_1093A,residualamount_127A,residualamount_3940956A,subjectrole_326M,subjectrole_43M,totalamount_503A,totalamount_881A
0,467,NaN,ea6782cc,2011-06-15,2031-06-13,7241344e,724be82a,3000000.0,10000.0,3000000.0,...,a55475b1,NaN,96a8fdfe,0.0,0.0,NaN,fa4f56f1,ab3c25cf,3000000.00,10000.0
1,467,NaN,ea6782cc,2019-01-04,2021-08-04,7241344e,724be82a,NaN,NaN,130365.0,...,a55475b1,NaN,96a8fdfe,NaN,NaN,NaN,ab3c25cf,ab3c25cf,78000.00,960000.0
2,467,78000.0,ea6782cc,2016-10-25,2019-10-25,7241344e,4257cbed,NaN,NaN,NaN,...,e914c86c,10.0,96a8fdfe,NaN,NaN,NaN,a55475b1,a55475b1,NaN,NaN
3,1445,NaN,ea6782cc,2015-01-30,2021-01-30,7241344e,1c9c5356,400000.0,100000.0,74000.0,...,a55475b1,NaN,60c73645,0.0,0.0,73044.18,daf49a8a,ab3c25cf,400000.00,100000.0
4,1445,NaN,01f63ac8,2014-09-12,2021-09-12,7241344e,724be82a,NaN,NaN,400000.0,...,a55475b1,NaN,96a8fdfe,NaN,NaN,NaN,ab3c25cf,ab3c25cf,396800.62,184587.8

(85791, 45)
86.8460807800293

,case_id,annualeffectiverate_199L,annualeffectiverate_63L,classificationofcontr_13M,classificationofcontr_400M,contractst_545M,contractst_964M,contractsum_5085717L,credlmt_230A,credlmt_935A,...,residualamount_488A,residualamount_856A,subjectrole_182M,subjectrole_93M,totalamount_6A,totalamount_996A,totaldebtoverduevalue_178A,totaldebtoverduevalue_718A,totaloutstanddebtvalue_39A,totaloutstanddebtvalue_668A
0,40626,NaN,NaN,ea6782cc,ea6782cc,7241344e,7241344e,NaN,0.0,NaN,...,0.0,NaN,ab3c25cf,ab3c25cf,NaN,180000.0,0.0,0.0,200944.12,0.0
1,40626,68.30,NaN,ea6782cc,01f63ac8,7241344e,7241344e,NaN,NaN,66978.0,...,NaN,40809.855,a55475b1,a55475b1,4000.0,NaN,NaN,NaN,NaN,NaN
2,40626,38.30,NaN,ea6782cc,01f63ac8,7241344e,7241344e,NaN,NaN,20000.0,...,NaN,19070.800,a55475b1,a55475b1,6000.0,NaN,NaN,NaN,NaN,NaN
3,40626,96.30,NaN,a55475b1,01f63ac8,a55475b1,7241344e,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,4000.0,NaN,NaN,NaN,NaN,NaN
4,40626,0.69,NaN,a55475b1,01f63ac8,a55475b1,7241344e,NaN,NaN,NaN,...,NaN,NaN,a55475b1,a55475b1,4000.0,NaN,NaN,NaN,NaN,NaN

(3743810, 79)
5776.342092514038

,case_id,collater_typofvalofguarant_298M,collater_typofvalofguarant_407M,collater_valueofguarantee_1124L,collater_valueofguarantee_876L,collaterals_typeofguarante_359M,collaterals_typeofguarante_669M,num_group1,num_group2,pmts_dpd_1073P,pmts_dpd_303P,pmts_month_158T,pmts_month_706T,pmts_overdue_1140A,pmts_overdue_1152A,pmts_year_1139T,pmts_year_507T,subjectroles_name_541M,subjectroles_name_838M
0,42865,9a0c095e,a55475b1,0.0,NaN,a55475b1,c7a5ad39,0,0,NaN,NaN,2.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,ab3c25cf
1,42865,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,1,NaN,NaN,3.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
2,42865,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,2,NaN,NaN,4.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
3,42865,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,3,NaN,NaN,5.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1
4,42865,a55475b1,a55475b1,NaN,NaN,a55475b1,a55475b1,0,4,NaN,NaN,6.0,NaN,NaN,NaN,2018.0,NaN,a55475b1,a55475b1

(25511332, 19)
12018.774509429932

,case_id,addres_district_368M,addres_role_871L,addres_zip_823M,conts_role_79M,empls_economicalst_849M,empls_employedfrom_796D,empls_employer_name_740M,num_group1,num_group2,relatedpersons_role_762T
0,5,a55475b1,None,a55475b1,a55475b1,a55475b1,None,a55475b1,0,0,None
1,6,P55_110_32,CONTACT,P10_68_40,P38_92_157,P164_110_33,None,a55475b1,0,0,None
2,6,P55_110_32,PERMANENT,P10_68_40,a55475b1,a55475b1,None,a55475b1,0,1,None
3,6,P204_92_178,CONTACT,P65_136_169,P38_92_157,P164_110_33,None,a55475b1,1,0,OTHER_RELATIVE
4,6,P191_109_75,CONTACT,P10_68_40,P7_147_157,a55475b1,None,a55475b1,1,1,OTHER_RELATIVE

(1643410, 11)
664.3765821456909

,case_id,actualdpd_943P,annuity_853A,approvaldate_319D,byoccupationinc_3656910L,cancelreason_3545846M,childnum_21L,creationdate_885D,credacc_actualbalance_314A,credacc_credlmt_575A,...,num_group1,outstandingdebt_522A,pmtnum_8L,postype_4733339M,profession_152M,rejectreason_755M,rejectreasonclient_4145042M,revolvingaccount_394A,status_219L,tenor_203L
0,2,0.0,640.2,None,NaN,a55475b1,0.0,2013-04-03,NaN,0.0,...,0,NaN,24.0,a55475b1,a55475b1,a55475b1,a55475b1,NaN,D,24.0
1,2,0.0,1682.4,None,NaN,a55475b1,0.0,2013-04-03,NaN,0.0,...,1,NaN,12.0,a55475b1,a55475b1,a55475b1,a55475b1,NaN,D,12.0
2,3,0.0,6140.0,None,NaN,P94_109_143,NaN,2019-01-07,NaN,0.0,...,0,NaN,12.0,a55475b1,a55475b1,P94_109_143,a55475b1,NaN,D,12.0
3,4,0.0,2556.6,None,NaN,P24_27_36,NaN,2019-01-08,NaN,0.0,...,0,NaN,24.0,a55475b1,a55475b1,a55475b1,a55475b1,NaN,T,24.0
4,5,0.0,NaN,None,NaN,P85_114_140,NaN,2019-01-16,NaN,NaN,...,0,NaN,NaN,a55475b1,a55475b1,a55475b1,a55475b1,NaN,T,NaN

(3887684, 41)
4734.420115470886